{
  "items": [
    {
      "id": "moozi-overview",
      "title": "Moozi - Tổng quan",
      "text": "Moozi là một trò chơi giáo dục nuôi bò ảo gồm nhiều giai đoạn: chào mừng, hướng dẫn lộ trình, thu thập cỏ, cho bò ăn, vắt sữa, và trả lời câu hỏi. Người chơi hoàn thành từng giai đoạn để tiến tới giai đoạn tiếp theo."
    },
    {
      "id": "stage-welcome",
      "title": "Giai đoạn Chào mừng",
      "text": "Khi người chơi bắt đầu, NPC sẽ chào mừng: 'Xin chào! Chào mừng đến với Moozi!'. Mục tiêu: trình bày nhiệm vụ ngắn gọn và hướng dẫn thao tác cơ bản (di chuyển, nhặt đồ). Thời lượng gợi ý: 4-8 giây."
    },
    {
      "id": "stage-tutorial",
      "title": "Giai đoạn Hướng dẫn lộ trình",
      "text": "Hướng dẫn lộ trình cho người chơi: chỉ dẫn các điểm cần đi qua (snap points), hiển thị mũi tên dẫn đường, và minh họa cách tương tác (nhặt cỏ, kéo thả). Nếu người chơi không tương tác trong 10s, hiển thị tip."
    },
    {
      "id": "stage-collect-grass",
      "title": "Giai đoạn Thu thập cỏ",
      "text": "Nhiệm vụ: thu thập 5 khối cỏ rải rác. Khi nhặt cỏ, phát particle + âm thanh 'pickup'. Kiểm tra rơi vào giỏ: khi thả vào giỏ, tăng progress. Nếu thiếu cỏ, NPC gợi ý vị trí."
    },
    {
      "id": "stage-feed-cow",
      "title": "Giai đoạn Cho bò ăn",
      "text": "Khi đã đủ cỏ, người chơi mang cỏ đến vùng bò. Kéo cỏ vào miệng bò hoặc thả vào máng ăn. Bò có animation ăn, phát âm thanh 'chew'. Khi ăn đủ, chuyển sang giai đoạn vắt sữa."
    },
    {
      "id": "stage-milk",
      "title": "Giai đoạn Vắt sữa",
      "text": "Người chơi dùng bình để vắt sữa: giữ nút tương tác và kéo theo hướng mũi tên. Yêu cầu: hoàn thành 3 lần vắt (mỗi lần 3 giây). Sau khi hoàn thành, mở minigame kiểm tra chất lượng sữa (ví dụ mini quiz)."
    },
    {
      "id": "stage-quiz",
      "title": "Giai đoạn Câu hỏi",
      "text": "Minigame câu hỏi có 3 câu multiple-choice về chăm sóc bò. Mỗi câu đúng +10 điểm. Nếu trả lời sai, cho gợi ý từ context (ví dụ quy tắc ăn uống)."
    },
    {
      "id": "npc-dokie",
      "title": "NPC Dokie - Lời thoại mẫu",
      "text": "Xin chào! Tôi là Dokie — sẽ hướng dẫn bạn cách chăm sóc Moozi.\nKhi cần gợi ý: 'Hãy đến khu thu thập cỏ (bên phải)' hoặc 'Đặt bình tại máng để vắt sữa'.\nKhi hoàn thành nhiệm vụ: 'Tuyệt vời! Bạn đã hoàn thành giai đoạn này.'"
    },
    {
      "id": "ui-feedback",
      "title": "Thông báo & Phản hồi UI",
      "text": "Các thông báo ngắn (toast) dùng cho: 'Cỏ đã thu thập: X/5', 'Đã cho bò ăn', 'Bắt đầu vắt sữa'. Nếu lỗi thao tác, hiện: 'Không thể thực hiện thao tác này ngay bây giờ.'"
    },
    {
      "id": "error-handling",
      "title": "Xử lý lỗi thường gặp trong gameplay",
      "text": "Nếu object dính vào tay (sticky grab), thử: reset Rigidbody, bật lại collider, hoặc kiểm tra Interactable settings. Nếu minigame không bật, kiểm tra điều kiện trigger (ví dụ progress flag)."
    },
    {
      "id": "scoring",
      "title": "Cách tính điểm",
      "text": "Mỗi hành động chính: thu thập cỏ +2 điểm, cho ăn +5 điểm, vắt sữa hoàn thành +10 điểm, trả lời đúng +10 điểm. Tổng điểm quyết định thứ hạng podium."
    },
    {
      "id": "fallback-rule",
      "title": "Quy tắc phản hồi nghiêm ngặt",
      "text": "Luật cho trợ lý: Chỉ trả lời dựa trên văn bản trong knowledge base. Nếu câu hỏi không thể trả lời bằng thông tin có sẵn, phản hồi đúng một câu: 'Xin lỗi, tôi không tìm thấy câu trả lời trong tài liệu.' Không thêm kiến thức bên ngoài."
    }
  ]
}
